; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c4-s1-p1-a6)

(:domain logistics)

(:objects a0 a1 a2 a3 a4 a5 - airplane
          c0 c1 c2 c3 - city
          t0 t1 t2 t3 t4 t5 t6 t7 t8 t9 t10 t11 t12 t13 t14 t15 t16 t17 t18 - truck
          l0-0 l1-0 l2-0 l3-0 - airport
          p0 - package
)

(:init
    (in-city  l0-0 c0)
    (in-city  l1-0 c1)
    (in-city  l2-0 c2)
    (in-city  l3-0 c3)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l2-0)
    (at t3 l3-0)
    (at t4 l1-0)
    (at t5 l2-0)
    (at t6 l3-0)
    (at t7 l2-0)
    (at t8 l3-0)
    (at t9 l3-0)
    (at t10 l1-0)
    (at t11 l0-0)
    (at t12 l3-0)
    (at t13 l0-0)
    (at t14 l1-0)
    (at t15 l1-0)
    (at t16 l2-0)
    (at t17 l3-0)
    (at t18 l1-0)
    (at p0 l0-0)
    (at a0 l3-0)
    (at a1 l2-0)
    (at a2 l2-0)
    (at a3 l2-0)
    (at a4 l3-0)
    (at a5 l1-0)
)

(:goal
    (and
        (at p0 l2-0)
    )
)
)

; plan
1. (fly a0 l3-0 l0-0)
   deleted: (at a0 l3-0)
   added: (at a0 l0-0)
   goals met: 0 of 1
2. (fly a1 l2-0 l0-0)
   deleted: (at a1 l2-0)
   added: (at a1 l0-0)
   goals met: 0 of 1
3. (fly a2 l2-0 l0-0)
   deleted: (at a2 l2-0)
   added: (at a2 l0-0)
   goals met: 0 of 1
4. (fly a3 l2-0 l0-0)
   deleted: (at a3 l2-0)
   added: (at a3 l0-0)
   goals met: 0 of 1
5. (fly a5 l1-0 l3-0)
   deleted: (at a5 l1-0)
   added: (at a5 l3-0)
   goals met: 0 of 1
6. (fly a3 l0-0 l2-0)
   deleted: (at a3 l0-0)
   added: (at a3 l2-0)
   goals met: 0 of 1
7. (fly a4 l3-0 l0-0)
   deleted: (at a4 l3-0)
   added: (at a4 l0-0)
   goals met: 0 of 1
8. (fly a5 l3-0 l0-0)
   deleted: (at a5 l3-0)
   added: (at a5 l0-0)
   goals met: 0 of 1
9. (load a0 p0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 a0)
   goals met: 0 of 1
10. (fly a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 0 of 1
11. (fly a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 0 of 1
12. (fly a2 l0-0 l1-0)
   deleted: (at a2 l0-0)
   added: (at a2 l1-0)
   goals met: 0 of 1
13. (fly a3 l2-0 l3-0)
   deleted: (at a3 l2-0)
   added: (at a3 l3-0)
   goals met: 0 of 1
14. (fly a4 l0-0 l1-0)
   deleted: (at a4 l0-0)
   added: (at a4 l1-0)
   goals met: 0 of 1
15. (fly a5 l0-0 l3-0)
   deleted: (at a5 l0-0)
   added: (at a5 l3-0)
   goals met: 0 of 1
16. (fly a0 l1-0 l2-0)
   deleted: (at a0 l1-0)
   added: (at a0 l2-0)
   goals met: 0 of 1
17. (fly a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 0 of 1
18. (fly a2 l1-0 l0-0)
   deleted: (at a2 l1-0)
   added: (at a2 l0-0)
   goals met: 0 of 1
19. (fly a3 l3-0 l0-0)
   deleted: (at a3 l3-0)
   added: (at a3 l0-0)
   goals met: 0 of 1
20. (fly a4 l1-0 l0-0)
   deleted: (at a4 l1-0)
   added: (at a4 l0-0)
   goals met: 0 of 1
21. (fly a5 l3-0 l0-0)
   deleted: (at a5 l3-0)
   added: (at a5 l0-0)
   goals met: 0 of 1
22. (fly a2 l0-0 l2-0)
   deleted: (at a2 l0-0)
   added: (at a2 l2-0)
   goals met: 0 of 1
23. (fly a3 l0-0 l1-0)
   deleted: (at a3 l0-0)
   added: (at a3 l1-0)
   goals met: 0 of 1
24. (fly a4 l0-0 l2-0)
   deleted: (at a4 l0-0)
   added: (at a4 l2-0)
   goals met: 0 of 1
25. (fly a5 l0-0 l1-0)
   deleted: (at a5 l0-0)
   added: (at a5 l1-0)
   goals met: 0 of 1
26. (unload a0 p0 l2-0)
   deleted: (in p0 a0)
   added: (at p0 l2-0)
   goals met: 1 of 1
